org/notepad.org
#+SETUPFILE: ../templates/index_config.org

* notepad

 - OpenAPI generators [[https://mux.com/blog/an-adventure-in-openapi-v3-api-code-generation/][mux.com]]
 - database, junction table [[https://stackoverflow.com/questions/444251/how-to-store-a-list-in-a-db-column][stackoverflow.com]]
 - Twitter: [[https://lanre.wtf/blog/2019/01/02/database-migration-golang/][lane.wtf]], https://spacekookie.de, https://jen20.dev, [[http://www.dr-qubit.org/undo-tree.html][http://www.dr-qubit.org]]
 - learn JavaScript (basis for electron, Angular, React). [[https://javascript.info/][javascript.info/]], You Don't Know JavaScript [[https://github.com/getify/You-Dont-Know-JS/blob/2nd-ed/get-started/ch1.md][github.com]], [[https://watchandcode.com/][watchandcode.com]], [[https://www.freecodecamp.org/][freecodecamp.org]]
 - learn advanced git [[https://learngitbranching.js.org/][learngitbranching.js.org]], [[https://www.atlassian.com/git/tutorials/advanced-overview][atlassian.com/git/tutorials]], [[https://rachelcarmena.github.io/2018/12/12/how-to-teach-git.html][rachelcarmena.github.io]], [[https://news.ycombinator.com/item?id=21189256][news.ycombinator.com]], 
 - learn advanced bash ~xargs~
 - learn databases [[https://sqlbolt.com/][sqlbolt.com]], [[https://www.reddit.com/r/rails/comments/dza84p/can_anyone_recommend_an_online_sql_course_that/][r/rails]]
 - deploy something (Heroku, AWS). Building A Cloud Native Application [[https://cloudacademy.com/course/building-cloud-native-application/introduction/][cloudacademy.com]] (7 day free trial), Developing Cloud-Native Apps with Microservices Architectures (Red Hat) [[https://www.udemy.com/course/developing-cloud-native-applications-microservices-architectures/learn/lecture/9382288#overview][udemy.com]], 
 - learn more about devops. The Complete Overview of DevOps [[https://www.reddit.com/r/devops/comments/dmwr6j/the_complete_overview_of_devops_cloud_native/][r/devops]]. [[https://medium.com/walmartlabs/cloud-native-application-architecture-a84ddf378f82][medium.com]].



* posts
- dataclass json schema validation



* learn
checksum, sha512, SMTP, FTP, SSH, HTTP, /dev/null
virtual console vs. terminal, CDN, POSIX


* work
- implemented GitHub infrastructure in Pulumi (X repositories)
- implemented AWS IAM Managemet in Pulumi (X policies, X )
