docs/notepad.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="fh">
<link  href="./assets/bootstrap.min.css" rel="stylesheet"></head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">notepad</a></li>
<li><a href="#sec-">posts</a></li>
<li><a href="#sec-">learn</a></li>
<li><a href="#sec-">work</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">notepad</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>database, junction table <a href="https://stackoverflow.com/questions/444251/how-to-store-a-list-in-a-db-column">stackoverflow.com</a><br >
</li>
<li>Twitter: <a href="https://lanre.wtf/blog/2019/01/02/database-migration-golang/">lane.wtf</a>, <a href="https://spacekookie.de">https://spacekookie.de</a>, <a href="https://jen20.dev">https://jen20.dev</a>, <a href="http://www.dr-qubit.org/undo-tree.html">http://www.dr-qubit.org</a><br >
</li>
<li>learn JavaScript (basis for electron, Angular, React). <a href="https://javascript.info/">javascript.info/</a>, You Don't Know JavaScript <a href="https://github.com/getify/You-Dont-Know-JS/blob/2nd-ed/get-started/ch1.md">github.com</a>, <a href="https://watchandcode.com/">watchandcode.com</a>, <a href="https://www.freecodecamp.org/">freecodecamp.org</a><br >
</li>
<li>learn advanced git <a href="https://learngitbranching.js.org/">learngitbranching.js.org</a>, <a href="https://www.atlassian.com/git/tutorials/advanced-overview">atlassian.com/git/tutorials</a>, <a href="https://rachelcarmena.github.io/2018/12/12/how-to-teach-git.html">rachelcarmena.github.io</a>, <a href="https://news.ycombinator.com/item?id=21189256">news.ycombinator.com</a>,<br >
</li>
<li>learn advanced bash <code>xargs</code><br >
</li>
<li>learn databases <a href="https://sqlbolt.com/">sqlbolt.com</a>, <a href="https://www.reddit.com/r/rails/comments/dza84p/can_anyone_recommend_an_online_sql_course_that/">r/rails</a><br >
</li>
<li>deploy something (Heroku, AWS). Building A Cloud Native Application <a href="https://cloudacademy.com/course/building-cloud-native-application/introduction/">cloudacademy.com</a> (7 day free trial), Developing Cloud-Native Apps with Microservices Architectures (Red Hat) <a href="https://www.udemy.com/course/developing-cloud-native-applications-microservices-architectures/learn/lecture/9382288#overview">udemy.com</a>,<br >
</li>
<li>learn more about devops. The Complete Overview of DevOps <a href="https://www.reddit.com/r/devops/comments/dmwr6j/the_complete_overview_of_devops_cloud_native/">r/devops</a>. <a href="https://medium.com/walmartlabs/cloud-native-application-architecture-a84ddf378f82">medium.com</a>.<br >
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">posts</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>dataclass json schema validation<br >
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">learn</h2>
<div class="outline-text-2" id="text-">
<p>
checksum, sha512, SMTP, FTP, SSH, HTTP, /dev/null<br >
virtual console vs. terminal, CDN, POSIX<br >
</p>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">work</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>implemented GitHub infrastructure in Pulumi (X repositories)<br >
</li>
<li>implemented AWS IAM Managemet in Pulumi (X policies, X )<br >
</li>
</ul>
</div>
</div>
</div></div></div>
</body>
</html>
